import React from 'react'
import {Col, Row} from 'react-styled-flexboxgrid'
import ReactHowler from 'react-howler'

class ContentPanel extends React.Component {

  constructor(props) {
    super(props)
  }

  render () {
    return (
      <div className='panel'>
        <b>คลังเสียงดิจิทัลที่ส่งผลทางด้านอารมณ์ความรู้สึกในบริบทของสังคมไทย: Thai-Sounds</b>
        <p className='name'>ธนปพน ภูสุวรรณ (ผู้พัฒนา) (chanpen2006@gmail.com)</p>
        <p className='name'>วิทยาลัยวิทยาการวิจัยและวิทยาการปัญญา มหาวิทยาลัยบูรพา</p>
        <p className='name'>รองศาสตราจารย์ ดร.เสรี ชัดแช้ม (ที่ปรึกษา) มหาวิทยาลัยบูรพา</p>
        <p className='name'>ดร.ศราวิน เทพสถิตย์ภรณ์ (ที่ปรึกษา) มหาวิทยาลัยบูรพา</p>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Thai-Sounds เป็นคลังเสียงดิจิทัลที่ส่งผลทางด้านอารมณ์ความรู้สึกในบริบทของสังคมไทยที่ได้พัฒนาขึ้นโดยใช้แนวความคิดของระบบเสียงดิจิทัลที่เป็นเสียงนานาชาติสากลที่ส่งผลต่ออารมณ์ความรู้สึก The International Affective Digitized Sounds (IADS) (Lang, Bradley, & Cuthbert, 1999) และการพัฒนาการศึกษาข้อมูลชุดสิ่งเร้าระบบเสียงดิจิทัลนานาชาติสากล ไอแอดส์-2 The International Affective Digitized Sounds (IADS-2) (Bradley & Lang, 2007) โดยมีเป้าหมายเพื่อเป็นสิ่งเร้าสำหรับการศึกษาทางด้านอารมณ์ความรู้สึก ที่ได้รวบรวมเสียงดิจิทัลที่ส่งผลทางด้านอารมณ์ความรู้สึกในบริบทของสังคมไทยและตรวจสอบคุณภาพของเสียงดิจิทัล ผ่านเกณฑ์การคัดเลือก และผ่านการวิเคราะห์หาคุณภาพความตรง และความเที่ยงอย่างเป็นระบบ กับกลุ่มตัวอย่างทั้งเพศหญิงและเพศชาย และกลุ่มตัวอย่างที่มีอายุระหว่าง 18-35 ปีและอายุระหว่าง 36-60 ปี จำนวน 400 คน พร้อมทั้งจัดหมวดหมู่ของอารมณ์ความรู้สึกออกเป็น 3 ด้าน ได้แก่ ด้านความประทับใจ (Valence) ด้านการตื่นตัว (Arousal) และด้านการมีอิทธิพล (Dominance) ที่ใช้เป็นสิ่งเร้าสำหรับในงานวิจัยเพื่อตรวจสอบอารมณ์ความรู้สึก</p>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;สำหรับผู้ที่สนใจต้องการใช้เสียงดิจิทัลเสียงดิจิทัลที่ส่งผลทางด้านอารมณ์ความรู้สึกในบริบทของสังคมไทย Thai-Sounds ในการศึกษาและพัฒนากาวิจัย เพื่อประโยชน์ทางการศึกษา หรือทางวิชาการ กรุณาอ่านรายละเอียดและกรอกแบบฟอร์ม Thai-Sounds Request Form เพื่อลงทะเบียนขอรับรหัสผ่านในการเข้าใช้งานหรือการดาวน์โหลดข้อมูล</p>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;หลังจากที่คุณได้รับรหัสผ่านในการเข้าใช้งานแล้ว จะมีระยะเวลาในการใช้งาน ได้ 30 วัน (สำหรับการใช้งานหรือการดาวน์โหลดข้อมูลขอความกรุณาทุกท่านปฏิบัติตาม เงื่อนไขในการใช้คำ ที่อยู่ภายในคลังเสียงดิจิทัลที่ส่งผลทางด้านอารมณ์ความรู้สึกในบริบทของสังคมไทย (Thai-Sounds)</p>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ท่านที่ต้องการใช้ข้อมูลเสียงดิจิทัลอยู่ในคลังเสียงดิจิทัลส่งผลทางด้านอารมณ์ความรู้สึกในบริบทของสังคมไทย (Thai-Sounds) หรือกล่าวถึงคลังเสียงดิจิทัล Thai-Sounds ในการศึกษา พัฒนางานวิจัย และทางวิชาการ กรุณาอ้างอิง: ธนปพน ภูสุวรรณ. (2561). การพัฒนาระบบคลังเสียงดิจิทัลที่ส่งผลทางด้านอารมณ์ความรู้สึกในบริบทของสังคมไทย. ดุษฎีนิพนธ์ปรัชญาดุษฎีบัณฑิต, สาขาวิชาการวิจัยและสถิติทางวิทยาการปัญญา, วิทยาลัยวิทยาการวิจัยและวิทยาการปัญญา, มหาวิทยาลัยบูรพา</p>
        <style jsx>{`
          b {
            font-size: 20px;
          }
          .name {
            color: blue;
          }
          .panel {
            display: inline-block;
            background: #ffffff;
            min-height: 100px;
            height: 70%;
            box-shadow:5px 5px black;
            margin: 100px;
            padding: 10px;
            opacity: 1.0;
            overflow-y: auto;
          }
          `}
        </style>
      </div>
    )
  }
}


export default ContentPanel
